tutorials/autoCalcBlock/constant/FLUID1/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/FLUID1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    minX
    {
        type            patch;
        nFaces          484;
        startFace       38072;
    }
    maxX
    {
        type            patch;
        nFaces          484;
        startFace       38556;
    }
    minY
    {
        type            patch;
        nFaces          704;
        startFace       39040;
    }
    maxY
    {
        type            patch;
        nFaces          704;
        startFace       39744;
    }
    minZ
    {
        type            patch;
        nFaces          704;
        startFace       40448;
    }
    maxZ
    {
        type            patch;
        nFaces          704;
        startFace       41152;
    }
    FLUID1_to_solid2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          500;
        startFace       41856;
        sampleMode      nearestPatchFace;
        sampleRegion    solid2;
        samplePatch     solid2_to_FLUID1;
    }
    FLUID1_to_solid1
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          500;
        startFace       42356;
        sampleMode      nearestPatchFace;
        sampleRegion    solid1;
        samplePatch     solid1_to_FLUID1;
    }
)

// ************************************************************************* //
