tutorials/autoCalcBlock/constant/solid1/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    solid1_to_solid2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2700;
        sampleMode      nearestPatchFace;
        sampleRegion    solid2;
        samplePatch     solid2_to_solid1;
    }
    solid1_to_FLUID1
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          500;
        startFace       2800;
        sampleMode      nearestPatchFace;
        sampleRegion    FLUID1;
        samplePatch     FLUID1_to_solid1;
    }
)

// ************************************************************************* //
