tutorials/autoCalcBlock/constant/FLUID1/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  fvDOM; 

fvDOMCoeffs
{
    nPhi 1;
    nTheta 2;
    convergence 0.001;
    maxIter 5;
} 

solverFreq 100;

absorptionEmissionModel none;

scatterModel    none;

sootModel       none;

// ************************************************************************* //
