tutorials/autoCalcBlock/0/FLUID1/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./system/configDict"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $:config.inlet.velocity;

boundaryField
{
    ".*"
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

    open
    {
        type        pressureInletOutletVelocity;
        value       uniform (0 0 0);
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform (0 0 0);
        value       uniform (0 0 0);
    }

    inlet
    {
        type        fixedValue;
        value       $internalField;
    }
}

#remove config;

// ************************************************************************* //
