tutorials/autoCalcBlock/0/solid2/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "./system/configDict"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $:config.temperature.start;

boundaryField
{
    ".*"
    {
        type        zeroGradient;
        value       $internalField;
    }

    coupledWall
    {
        type        compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr        T;
        kappa       solidThermo;
        kappaName   none;
        value       $internalField;
    }

    coupledRadiationWall
    {
        type        compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr        T;
        kappa       solidThermo;
        kappaName   none;
        Qr          none;
        QrNbr       Qr;
        value       $internalField; 
    }
}

#remove config;

// ************************************************************************* //
