tutorials/autoCalcBlock/system/FLUID1/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./system/codeDict"

dictionaryReplacement
{
    boundary
    {
        "oldInternalFaces"
        {
            type            wall;
        }

        "F.*"
        {
            inGroups        ($:config.changeDictionary.coupledWallType);
        }

        "(min|max)."
        {
            inGroups        (open);
        }
    }
}

#remove config;

// ************************************************************************* //
