tutorials/autoCalcBlock/system/FLUID1/createBafflesDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 object createBafflesDict; 	
}

internalFacesOnly true;

baffles
{
} 	

