tutorials/autoCalcBlock/system/FLUID1/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "./system/codeDict"

temperatureLimit
{
    active          on;
    selectionMode   all;
    type            temperatureLimitsConstraint;
    temperatureLimitsConstraintCoeffs
    {
        Tmin            $:config.temperature.min;
        Tmax            $:config.temperature.max;
    }
}

$:config.fvOptions

#remove config;
