tutorials/autoCalcBlock/system/solid1/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "./system/configDict"

temperatureLimit
{
    active          on;
    selectionMode   all;
    temperatureLimitsConstraintCoeffs
    {
        Tmin            $:config.temperature.min;
        Tmax            $:config.temperature.max;
    }
    type            temperatureLimitsConstraint;
}

heatSource
{
    active          #calc "bool($:config.solids.solid1.power)";
    scalarSemiImplicitSourceCoeffs
    {
        injectionRateSuSp
        {
            h           ( $:config.solids.solid1.power 0 );
        }
        volumeMode absolute;
    }
    selectionMode   all;
    type            scalarSemiImplicitSource;
}

#remove config;
