tutorials/autoCalcBlock/system/solid2/decomposeParDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 note "mesh decomposition control dictionary"; 	
 location "system"; 	
 object decomposeParDict; 	
}

numberOfSubdomains 4;

method hierarchical; 	

simpleCoeffs
{
} 	

hierarchicalCoeffs
{
  n (2 2 1);
  delta 0.001; 	
  order xyz; 	
} 	

manualCoeffs
{
} 	// ************************************************************************* //

