tutorials/autoCalcBlock/system/variableConfigDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      variableConfigDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundingBox     2 ( ( -0.005 -0.005 -0.005 ) ( 0.015 0.005 0.005 ) );

solids
{
    solid1
    {
        conductivity    210;
        elementLength   0.001;
        emissivity      0.8;
        power           0;
    }
    
    solid2
    {
        conductivity    210;
        elementLength   0.001;
        emissivity      0.8;
        power           0;
    }
}

blanks
{
//    blank
//    {
//        elementLength   0.001;
//        fileType        stl;
//    }
}

baffles
{
//    baffle
//    {
//        elementLength   0.001;
//        thickness       0.001;
//        kappa           5.0;
//        fileType        stl;
//    }
}

rotations
{
//    ROT1
//    {
//        elementLength   0.0005;
//        radius          0.018;
//        rpm             4500.0;
//        axis
//        (
//            (0.058659 0.006001 0.0495)
//            (0.058659 -0.00912 0.0495)
//        );
//    }
}

refinements
{
//    refinement
//    {
//        elementLength   0.001;
//        fileType        stl;
//    }
}

//fluids
//{
//    FLUID1
//    {
//        rotations       ();
//        baffles         ();
//    }
//}


// ************************************************************************* //
